In [2]:
#skip
import pandas as pd
import numpy as np
new_lab = pd.read_csv("df_labdata.csv")
new_lab["source"] = "Highmark"
new_lab.rename(columns={"test_result": "result", "test_unit": 'Units'}, inplace = 'True')
new_lab['test_name'] = new_lab['test_name'].str.lower()
old_lab = pd.read_csv('TMA_lab.csv')
old_lab['Lab_Date'] = pd.to_datetime(old_lab.Lab_Date)
old_lab.rename(columns={"Lab_Date": "date", "Results": "result", "Code": "test_name"}, inplace = 'True')
old_lab['test_name'] = old_lab['test_name'].str.lower()
old_lab["source"] = "TMA"
master = pd.read_csv("master.csv")
lab = pd.read_csv("lab.csv")
def num(df):
    print(len(df))
    print(len(df['TMA_Acct'].unique()))
def show(df, n):
    print(pd.DataFrame(df[df['TMA_Acct'] == n]))

C:\Users\DELL\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3063: DtypeWarning: Columns (4) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [1]:
#step1
import pandas as pd
import numpy as np
lab = pd.read_csv("lab_total.csv")
master = pd.read_csv("master.csv")
def num(df):
    print(len(df))
    print(len(df['TMA_Acct'].unique()))
def show(df, n):
    print(pd.DataFrame(df[df['TMA_Acct'] == n]))

C:\Users\DELL\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3063: DtypeWarning: Columns (5) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [3]:
new_lab.head(2)

,Unnamed: 0,TMA_Acct,dos_deidentified,clinic_name_deidentified,test_name,result,Units,abnormal_flag,range_low_value,range_high_value,loinc_code,date,source
0,0,1483,15,1.0,rbc/hpf cells,0.0,NaN,,0.0,3.0,58081,2010-01-16,Highmark
1,1,49053,2759,2.0,ld,237.0,UNITS,,120.0,250.0,25320,2017-07-22,Highmark

In [4]:
old_lab.head(2)

,Unnamed: 0,TMA_Acct,date,test_name,result,Lab_Company,Status,Units,Order_Doctor,source
0,0,9,2008-08-29,iron tibc,305.6,ALIQHOSP,NaN,NaN,NaN,TMA
1,1,9,2005-01-03,hemoglobin,13.4,ALIQHOSP,NaN,NaN,NaN,TMA

In [5]:
lab.head(2)

   Unnamed: 0  TMA_Acct                 date   test_name result Units source
0           0         9  2008-08-29 00:00:00   iron tibc  305.6   NaN    TMA
1           1         9  2005-01-03 00:00:00  hemoglobin   13.4   NaN    TMA

In [6]:
len(lab) + len(new_lab) + len(old_lab)

8148178

In [7]:
new_lab = new_lab[['TMA_Acct', 'date', 'test_name', 'result', 'Units', 'source']]
old_lab = old_lab[['TMA_Acct', 'date', 'test_name', 'result', 'Units', 'source']]
lab = pd.concat([lab, new_lab, old_lab], axis = 0)

In [9]:
lab.head(2)

   Unnamed: 0  TMA_Acct                 date   test_name result Units source
0         0.0         9  2008-08-29 00:00:00   iron tibc  305.6   NaN    TMA
1         1.0         9  2005-01-03 00:00:00  hemoglobin   13.4   NaN    TMA

In [10]:
lab.to_csv("lab_total.csv")

### combine lab together

In [1]:
#skip this part

In [18]:
old_lab.head(2)

,Unnamed: 0,TMA_Acct,date,test_name,result,Lab_Company,Status,Units,Order_Doctor,source
0,0,9,2008-08-29,iron tibc,305.6,ALIQHOSP,NaN,NaN,NaN,TMA
1,1,9,2005-01-03,hemoglobin,13.4,ALIQHOSP,NaN,NaN,NaN,TMA

In [19]:
lab4 = pd.read_excel("LabResults Apr2017.xls")
lab1 = pd.read_excel("LabResults Feb2017.xls")
lab2 = pd.read_excel("LabResults May2017.xls")
lab3 = pd.read_excel("LabResults Mar2017.xls")
lab5 = pd.read_excel("LabResults Jan2017.xls")
lab6 = pd.read_excel("LabResults Jun2017.xls")

In [20]:
len(lab6) + len(lab5)+len(lab4)+len(lab3)+len(lab2)+len(lab1)

328080

In [21]:
lab = pd.concat([lab1,lab2,lab3,lab4,lab5,lab6], axis = 0)
lab.rename(columns={"Date": "date", "Results": "result", "Code": "test_name", "Acct#": "TMA_Acct"}, inplace = 'True')
lab['source'] = "TMA"
lab['test_name'] = lab['test_name'].str.lower()

In [22]:
lab.head(2)

,TMA_Acct,date,test_name,result,Lab Company,Status,Units,source
0,43327,02/13/2017,egfr-oth,43,Washington Hospital,Closed,NaN,TMA
1,43327,02/13/2017,egfr-afa,52,Washington Hospital,Closed,NaN,TMA

In [23]:
new_lab = new_lab[['TMA_Acct', 'date', 'test_name', 'result', 'Units', 'source']]
old_lab = old_lab[['TMA_Acct', 'date', 'test_name', 'result', 'Units', 'source']]
lab = lab[['TMA_Acct', 'date', 'test_name', 'result', 'Units','source']]

In [24]:
lab_all = pd.concat([old_lab, new_lab,lab], axis = 0)

In [25]:
lab_all.head(2)

   TMA_Acct                 date   test_name result Units source
0         9  2008-08-29 00:00:00   iron tibc  305.6   NaN    TMA
1         9  2005-01-03 00:00:00  hemoglobin   13.4   NaN    TMA

In [26]:
lab_all.to_csv("lab.csv")

### Retrieve Serum

In [2]:
#step2
serum = pd.read_csv('serum.csv')

In [50]:
num(serum)

203878
12859

In [51]:
serum.head(2)

   Unnamed: 0  TMA_Acct        date  result Units   test_name source
0           3         9  2004-02-03     1.1   NaN  creatinine    TMA
1          22         9  2006-12-27     1.2   NaN  creatinine    TMA

In [12]:
serum_name = ['cre', 'creat egfr', 'creatinine serum', 'crea', 'creatinine, seru', 'creatinine', 'creatinine [mass/volume] in serum or plasma', 'creatine, serum', 'creatin']
serum = lab[lab['test_name'].isin(serum_name)][['TMA_Acct', 'date', 'result', 'Units', 'test_name', 'source']]
num(serum)
serum.head(2)

252840
13811

    TMA_Acct                 date result Units   test_name source
3          9  2004-02-03 00:00:00    1.1   NaN  creatinine    TMA
22         9  2006-12-27 00:00:00    1.2   NaN  creatinine    TMA

In [13]:
delete = ['Canceled', 'Creamin', 'Ignore Results,', 'Laboratory Cance  See Note ', 'NR', 'TNP','>60']
serum = serum[~serum.result.isin(delete)]
num(serum)
serum.date = pd.to_datetime(serum.date)
serum.result = serum.result.str.replace('\(.*', '').str.strip()
serum = serum.dropna(subset = ['result'])
serum = serum.replace('0.75 L', '0.75')
serum = serum.replace('0.89 MG/DL', '0.89')
serum = serum.replace('.0.7', '0.7')
serum = serum.replace('.1.49', '1.49')
serum = serum.replace('2.51 2.1)', '2.51')
serum.result = serum.result.str.replace('/.*', '').str.strip()
serum.result = serum.result.str.replace(' .*', '').str.strip()

252821
13811

In [14]:
wrong_result = []
for i in serum.result:
    try:
        float(i)
        pass
    except:
        wrong_result.append(i)
print("wrong result")
print(len(wrong_result))
print("wrong result")
num(serum)
serum.head(2)

wrong result
0
wrong result
203878
12859

    TMA_Acct       date result Units   test_name source
3          9 2004-02-03    1.1   NaN  creatinine    TMA
22         9 2006-12-27    1.2   NaN  creatinine    TMA

In [17]:
serum.to_csv('serum.csv')

### Master

In [14]:
master = pd.read_csv('master.csv')
num(master)
master.drop(master.loc[(master.TMA_Acct == 25831) & (master.DOB == '00-01-1900')].index, inplace=True)
master.drop(master.loc[(master.TMA_Acct == 32967) & (master.DOB == '19-08-2011')].index, inplace=True)
master.drop(master.loc[(master.TMA_Acct == 44639) & (master.DOB == '16-06-1959')].index, inplace=True)
master.drop(master.loc[(master.TMA_Acct == 17506) & (master.Race == 'White')].index, inplace=True)
master.drop(master.loc[(master.TMA_Acct == 36531) & (master.Race == 'Asian')].index, inplace=True)
master.drop(master.loc[(master.TMA_Acct == 42869) & (master.Race == 'Other')].index, inplace=True)
master.drop(master.loc[(master.TMA_Acct == 45900) & (master.Race == 'White')].index, inplace=True)
master.drop(master.loc[(master.TMA_Acct == 34714) & (master.Sex == 'Female')].index, inplace=True)
num(master)
base = master
base = master[['TMA_Acct', 'DOB', 'Sex', 'Race']]
base['DOB'] = base['DOB'].str[-4:]
base = base.replace('Black / African American', 'Black/African American')
base = base.replace('Declined to Specify / Unknown', 'Declined to Specify/Unknown')
base = base.replace('Other Race', 'Other')
base['race_v'] = base['Race'].apply(lambda x: 1 if x == 'Black/African American' or x == 'Black/African American, Other' else 0)
base = base.drop_duplicates()
num(base)
base.head(2)

16410
14816
16402
14816
14868
14816

C:\Users\DELL\anaconda3\lib\site-packages\ipykernel_launcher.py:14: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

   TMA_Acct   DOB     Sex   Race  race_v
0         9  1921    Male  White       0
1        10  1926  Female    NaN       0

In [15]:
base_main = base[["TMA_Acct", "DOB", "Sex"]]
base_main = base_main.drop_duplicates()
print(len(base_main))
base_race = base[["TMA_Acct", "Race", 'race_v']]
base_race = base_race.drop_duplicates()
base_race = base_race.dropna(subset = ['Race'])
print(len(base_race))
base = pd.merge(base_main, base_race, how = 'left', left_on = 'TMA_Acct', right_on = 'TMA_Acct')
num(base)

14816
8167
14816
14816

In [16]:
check = pd.DataFrame(base.groupby('TMA_Acct').size() > 1).reset_index()
check = list(set(check[check[0] == True]['TMA_Acct']))
len(check)

0

In [17]:
base.to_csv('base.csv')

In [3]:
#step3
base = pd.read_csv('base.csv')
base['race_v'] = base['Race'].apply(lambda x: 1 if x == 'Black/African American' or x == 'Black/African American, Other' else 0)
num(base)

14816
14816

### Serum + Base ---> EGFR

In [64]:
serum_egfr = pd.merge(serum, base, how = 'left', left_on = 'TMA_Acct', right_on = 'TMA_Acct')
serum_egfr['sex_v'] = serum_egfr['Sex'].apply(lambda x: 1 if x == 'Female' else 0)
serum_egfr['result'] = serum_egfr['result'].astype('float')
num(serum_egfr)
serum_egfr.head(2)

203878
12859

,Unnamed: 0_x,TMA_Acct,date,result,Units,test_name,source,Unnamed: 0_y,DOB,Sex,Race,race_v,sex_v
0,3,9,2004-02-03,1.1,NaN,creatinine,TMA,0.0,1921.0,Male,White,0.0,0
1,22,9,2006-12-27,1.2,NaN,creatinine,TMA,0.0,1921.0,Male,White,0.0,0

In [65]:
serum_egfr_notnull = serum_egfr.dropna(subset = ['DOB'])

In [67]:
miss = list(set([i for i in list(serum_egfr['TMA_Acct']) if i not in list(serum_egfr_notnull['TMA_Acct'])]))

In [23]:
serum_egfr['date'] = pd.to_datetime(serum_egfr.date)
serum_egfr['year'] = serum_egfr['date'].dt.year
num(serum_egfr)
serum_egfr = serum_egfr.dropna(subset = ['DOB'])
num(serum_egfr)
serum_egfr['k'] = serum_egfr['sex_v'] * 0.7 + (1 - serum_egfr['sex_v']) * 0.9
serum_egfr['alpha'] = serum_egfr['sex_v'] * (-0.329) + (1 - serum_egfr['sex_v']) * (-0.411)
serum_egfr['age'] = serum_egfr['year'] - serum_egfr['DOB']
serum_egfr['firstmin'] = serum_egfr['result'] * 1 / serum_egfr['k']
serum_egfr['firstmin'] = serum_egfr['firstmin'].apply(lambda x: 1 if x > 1 else x)
serum_egfr['secondmax'] = serum_egfr['result'] * 1 / serum_egfr['k']
serum_egfr['secondmax'] = serum_egfr['secondmax'].apply(lambda x: 1 if x < 1 else x)
serum_egfr['egfr'] = 141 * (serum_egfr['firstmin'] ** serum_egfr['alpha']) * (serum_egfr['secondmax'] ** (-1.209)) * (0.993 ** serum_egfr['age']) * (1.018 ** serum_egfr['sex_v']) * (1.159 ** serum_egfr['race_v'])
num(serum_egfr)
serum_egfr.head(2)

203878
12859
148982
7388
148982
7388

,Unnamed: 0_x,TMA_Acct,date,result,Units,test_name,source,Unnamed: 0_y,DOB,Sex,Race,race_v,sex_v,year,k,alpha,age,firstmin,secondmax,egfr
0,3,9,2004-02-03,1.1,NaN,creatinine,TMA,0.0,1921.0,Male,White,0.0,0,2004,0.9,-0.411,83.0,1.0,1.222222,61.750741
1,22,9,2006-12-27,1.2,NaN,creatinine,TMA,0.0,1921.0,Male,White,0.0,0,2006,0.9,-0.411,85.0,1.0,1.333333,54.809306

In [24]:
serum_egfr['source'] = serum_egfr['source'] + '_Serum'

In [25]:
serum_egfr.to_csv('serum_egfr.csv')

In [42]:
#step4
serum_egfr = pd.read_csv('serum_egfr.csv')
num(serum_egfr)
serum_egfr.head(2)

148982
7388

,Unnamed: 0,Unnamed: 0_x,TMA_Acct,date,result,Units,test_name,source,Unnamed: 0_y,DOB,...,Race,race_v,sex_v,year,k,alpha,age,firstmin,secondmax,egfr
0,0,3,9,2004-02-03,1.1,NaN,creatinine,TMA_Serum,0.0,1921.0,...,White,0.0,0,2004,0.9,-0.411,83.0,1.0,1.222222,61.750741
1,1,22,9,2006-12-27,1.2,NaN,creatinine,TMA_Serum,0.0,1921.0,...,White,0.0,0,2006,0.9,-0.411,85.0,1.0,1.333333,54.809306

In [43]:
#step5
serum_egfr = serum_egfr[['TMA_Acct', 'date', 'egfr', 'source']]
num(serum_egfr)
serum_egfr.head(2)

148982
7388

   TMA_Acct        date       egfr     source
0         9  2004-02-03  61.750741  TMA_Serum
1         9  2006-12-27  54.809306  TMA_Serum

### EGFR Lab

In [5]:
egfr_name = ['african american egfr', 'egfr', 'egfr african american', 'egfr non afr american', 'egfr non-afr. american', 'non-african american egfr', 'af-am egfr','egfr (african amercn)', 'egfr (african american)', 'egfr (non-afr american)', 'egfr africanamerican', 'egfr-afa', 'egfram', 'non-af-am egfr']
egfr = lab[lab['test_name'].isin(egfr_name)][['TMA_Acct', 'test_name', 'date', 'result', 'source']]
egfr = egfr.replace('egfr african american', 'african american egfr')
egfr = egfr.replace('egfr non afr american', 'egfr')
egfr = egfr.replace('egfr non-afr. american', 'egfr')
egfr = egfr.replace('non-african american egfr', 'egfr')
egfr = egfr.replace('af-am egfr', 'african american egfr')
egfr = egfr.replace('egfr (african amercn)', 'african american egfr')
egfr = egfr.replace('egfr (african american)', 'african american egfr')
egfr = egfr.replace('egfr africanamerican', 'african american egfr')
egfr = egfr.replace('egfr-afa', 'african american egfr')
egfr = egfr.replace('non-af-am egfr', 'egfr')
egfr = egfr.replace('egfr (non-afr american)', 'egfr')
egfr = egfr.replace('egfram', 'egfr')
egfr['race_v'] = egfr['test_name'].apply(lambda x: 1 if x == 'african american egfr' else 0)
num(egfr)
#unit 'ML/MIN/1.73M2', nan, 'mL/min', 'mL/min/1.73', '10*3/uL', '1'

123161
5563

In [37]:
egfr.head(2)

      TMA_Acct test_name                 date result source  race_v
2236        86      egfr  2011-01-22 00:00:00     27    TMA       0
2591        86      egfr  2011-04-27 00:00:00     20    TMA       0

In [16]:
# highmark_egfr = ['african american egfr', 'egfr', 'egfr african american', 'egfr non afr american', 'egfr non-afr. american', 'non-african american egfr']
# new_egfr = new_lab[new_lab['test_name'].isin(highmark_egfr)][['TMA_Acct', 'test_name', 'date', 'result']]
# new_egfr = new_egfr.replace('egfr african american', 'african american egfr')
# new_egfr = new_egfr.replace('egfr non afr american', 'egfr')
# new_egfr = new_egfr.replace('egfr non-afr. american', 'egfr')
# new_egfr = new_egfr.replace('non-african american egfr', 'egfr')
# new_egfr['source'] = 'Highmark_Lab_Egfr'
# num(new_egfr)
# # unit ML/MIN/1.73M2
# TMA_egfr = ['af-am egfr','egfr', 'egfr (african amercn)', 'egfr (african american)', 'egfr (non-afr american)', 'egfr africanamerican', 'egfr-afa', 'egfram', 'non-af-am egfr']
# old_egfr = old_lab[old_lab['test_name'].isin(TMA_egfr)][['TMA_Acct', 'test_name', 'date', 'result']]
# old_egfr = old_egfr.replace('af-am egfr', 'african american egfr')
# old_egfr = old_egfr.replace('egfr (african amercn)', 'african american egfr')
# old_egfr = old_egfr.replace('egfr (african american)', 'african american egfr')
# old_egfr = old_egfr.replace('egfr africanamerican', 'african american egfr')
# old_egfr = old_egfr.replace('egfr-afa', 'african american egfr')
# old_egfr = old_egfr.replace('non-af-am egfr', 'egfr')
# old_egfr = old_egfr.replace('egfr (non-afr american)', 'egfr')
# old_egfr = old_egfr.replace('egfram', 'egfr')
# old_egfr['source'] = 'TMA_Lab_Egfr'
# num(old_egfr)
# #unit 'ML/MIN/1.73M2', nan, 'mL/min', 'mL/min/1.73', '10*3/uL', '1'

48408
2996
12605
3118

In [6]:
african = egfr[egfr['test_name'] == 'african american egfr']
num(african)
white = egfr[egfr['test_name'] == 'egfr']
num(white)

72912
5494
50249
3119

In [7]:
double = list(set([i for i in list(african['TMA_Acct']) if i in list(white['TMA_Acct'])]))
len(double)

3050

In [8]:
single = list(set([i for i in list(egfr['TMA_Acct']) if i not in double]))
len(single)

2513

In [9]:
single_egfr = egfr[egfr['TMA_Acct'].isin(single)]
num(single_egfr)

21007
2513

In [10]:
double_egfr = egfr[egfr['TMA_Acct'].isin(double)]
num(double_egfr)

102154
3050

In [11]:
double_withoutbase = [i for i in list(double_egfr['TMA_Acct']) if i not in list(base['TMA_Acct'])]

In [12]:
double_withoutbase = set(double_withoutbase)

In [13]:
len((double_withoutbase))

200

In [14]:
doublr_efgr_in = double_egfr[~double_egfr['TMA_Acct'].isin(double_withoutbase)]
num(doublr_efgr_in)
doublr_efgr_in = pd.merge(doublr_efgr_in, base, how = 'inner', left_on = ['TMA_Acct', 'race_v'], right_on = ['TMA_Acct', 'race_v'])

96510
2850

In [15]:
double_efgr_not = double_egfr[double_egfr['TMA_Acct'].isin(double_withoutbase)]
num(double_efgr_not)

5644
200

In [16]:
double_efgr_not = double_efgr_not[double_efgr_not['race_v'] == 0]
num(double_efgr_not)

2814
200

In [17]:
egfr = pd.concat([single_egfr, doublr_efgr_in, double_efgr_not], axis = 0)
num(egfr)

71224
5563

In [18]:
egfr.to_csv('egfr.csv')

In [55]:
#step5
egfr = pd.read_csv('egfr.csv')
num(egfr)

71224
5563

In [56]:
#step6
egfr = egfr[['TMA_Acct', 'date', 'result', 'source']]
egfr.rename(columns={"result": "egfr"}, inplace = 'True')
egfr.head(2)

   TMA_Acct                 date egfr source
0       116  2011-05-29 00:00:00   23    TMA
1       116  2011-05-19 00:00:00   25    TMA

### Combine Egfr

In [22]:
def mapping(n):
    if n >= 90.0: stage = '1'
    elif n >= 60.0: stage = '2'
    elif n >= 45.0: stage = '3a'
    elif n >= 30.0: stage = '3b'
    elif n >= 15.0: stage = '4'
    else: stage = '5'
    return(stage)

In [57]:
serum_egfr.head(2)

   TMA_Acct        date       egfr     source
0         9  2004-02-03  61.750741  TMA_Serum
1         9  2006-12-27  54.809306  TMA_Serum

In [58]:
egfr.head(2)

   TMA_Acct                 date egfr source
0       116  2011-05-29 00:00:00   23    TMA
1       116  2011-05-19 00:00:00   25    TMA

In [63]:
All_egfr = pd.concat([serum_egfr, egfr], axis = 0)
num(All_egfr)
delete = ['Canceled', 'Creamin', 'Ignore Results,', 'Laboratory Cance  See Note ', 'NR', 'TNP', '>60', '(See Note)', 'See Note']
All_egfr = All_egfr[~All_egfr.egfr.isin(delete)]
num(All_egfr)
All_egfr['egfr'] = All_egfr['egfr'].astype('float')
def mapping(n):
    if n >= 90.0: stage = '1'
    elif n >= 60.0: stage = '2'
    elif n >= 45.0: stage = '3a'
    elif n >= 30.0: stage = '3b'
    elif n >= 15.0: stage = '4'
    else: stage = '5'
    return(stage)
All_egfr['stage'] = All_egfr['egfr'].apply(lambda x: mapping(x))
num(All_egfr)
All_egfr = All_egfr.drop_duplicates()
num(All_egfr)
All_egfr = All_egfr.sort_values(['TMA_Acct', 'date'])

220206
9360
217631
9137
217631
9137
105816
9137

In [60]:
All_egfr.to_csv('All_egfr.csv')

In [61]:
#step7
All_egfr = pd.read_csv('All_egfr.csv')
num(All_egfr)

105816
9137

In [62]:
All_egfr.head(2)

   Unnamed: 0  TMA_Acct        date       egfr     source stage
0          16         9  2000-09-22  43.651041  TMA_Serum    3b
1          11         9  2000-11-15  47.448244  TMA_Serum    3a

## Heap

In [27]:
early = pd.DataFrame(All_egfr.groupby(['TMA_Acct']).agg({'date': [np.min]})).reset_index()
early.columns=['TMA_Acct', 'min']
num(early)
early.head(2)

9137
9137

   TMA_Acct         min
0         9  2000-09-22
1        12  2000-08-03

In [28]:
enter_after_2018_12_31 = list(early[(early['min'] > '2018-12-31')]['TMA_Acct'])
All_egfr = All_egfr[~All_egfr['TMA_Acct'].isin(enter_after_2018_12_31)]
# acct_in_2010_2018 = list(All_egfr[(All_egfr['date'] > '2009-12-31') & (All_egfr['date'] < '2019-01-01')]['TMA_Acct'])
# All_egfr =  All_egfr[All_egfr['TMA_Acct'].isin(acct_in_2010_2018)]
num(All_egfr)

183136
9107

In [29]:
enter_after_2010 = early[(early['min'] > '2009-12-31') & (early['min'] <= '2019-01-01')]
num(enter_after_2010)

4702
4702

In [30]:
first_enter_after_2010 = pd.merge(All_egfr, enter_after_2010, how = 'inner', left_on = ['TMA_Acct', 'date'], right_on = ['TMA_Acct', 'min'])
num(first_enter_after_2010)

7983
4699

In [31]:
first_enter_after_2010_egfr = pd.DataFrame(first_enter_after_2010[['TMA_Acct', 'egfr']].groupby(['TMA_Acct']).agg({'egfr': np.mean})).reset_index()

In [32]:
first_enter_after_2010_egfr['stage'] = first_enter_after_2010_egfr['egfr'].apply(lambda x: mapping(x))

In [33]:
first_enter_after_2010_date = first_enter_after_2010[['TMA_Acct', 'date']]
first_enter_after_2010_date = first_enter_after_2010_date.drop_duplicates()
num(first_enter_after_2010_date)

4699
4699

In [34]:
first_enter_after_2010_stage = pd.merge(first_enter_after_2010_egfr, first_enter_after_2010_date, how = 'inner', left_on = 'TMA_Acct', right_on = 'TMA_Acct')

In [35]:
num(first_enter_after_2010_stage)

4699
4699

In [36]:
first_enter_after_2010_stage

      TMA_Acct       egfr stage                 date
0           64  10.000000     5  2018-05-15 00:00:00
1           86  20.121101     4           2010-10-09
2          208  32.311473    3b           2015-06-09
3          268  48.000000    3a           2012-01-07
4          461  50.000000    3a  2018-11-07 00:00:00
...        ...        ...   ...                  ...
4694     51471  36.000000    3b  2018-12-21 00:00:00
4695     51529  31.000000    3b  2018-12-26 00:00:00
4696     51580  37.000000    3b  2018-12-21 00:00:00
4697     52742  45.000000    3a  2018-01-30 00:00:00
4698     53388  47.000000    3a  2018-09-18 00:00:00

[4699 rows x 4 columns]

### Part1

In [38]:
part1 = first_enter_after_2010_stage

In [31]:
acct_enter_after_2009 = list(first_enter_after_2010_stage['TMA_Acct'])

In [32]:
acct_enter_before_2010 = list(All_egfr[~All_egfr['TMA_Acct'].isin(acct_enter_after_2009)]['TMA_Acct'])

In [33]:
all_egfr_enter_before_2010 = All_egfr[All_egfr['TMA_Acct'].isin(acct_enter_before_2010)]
num(all_egfr_enter_before_2010)

43193
1784

In [34]:
all_egfr_enter_before_2010[all_egfr_enter_before_2010['TMA_Acct'] == 1935]

      Unnamed: 0  TMA_Acct        date       egfr             source stage
4573        3676      1935  2007-09-13  57.841470      TMA_Lab_Serum    3a
4574        3675      1935  2007-12-06  51.546070      TMA_Lab_Serum    3a
4575        3684      1935  2008-12-04  65.239312      TMA_Lab_Serum     2
4576        3679      1935  2008-12-11  51.185248      TMA_Lab_Serum    3a
4577        3682      1935  2008-12-30  51.185248      TMA_Lab_Serum    3a
4578        3683      1935  2009-03-18  57.034523      TMA_Lab_Serum    3a
4579        3678      1935  2009-09-30  45.751748      TMA_Lab_Serum    3a
4580        3680      1935  2010-10-01  50.471162      TMA_Lab_Serum    3a
4581       33359      1935  2011-06-19  61.000000  Highmark_Lab_Egfr     2
4582        3677      1935  2011-09-26  50.674290      TMA_Lab_Serum    3a
4583       33360      1935  2011-09-27  51.000000  Highmark_Lab_Egfr    3a
4584        3685      1935  2012-09-04  55.845163      TMA_Lab_Serum    3a
4585        3681      1935  2013-09-11  62.987680      TMA_Lab_Serum     2

### Part2

In [35]:
egfr_1 = all_egfr_enter_before_2010[(all_egfr_enter_before_2010['date'] > '2009-12-31') & (all_egfr_enter_before_2010['date'] < '2010-04-01')]
early_1 = pd.DataFrame(egfr_1.groupby(['TMA_Acct']).agg({'date': [np.min]})).reset_index()
early_1.columns=['TMA_Acct', 'min']
early_1_all = pd.merge(all_egfr_enter_before_2010, early_1, how = 'inner', left_on = ['TMA_Acct', 'date'], right_on = ['TMA_Acct', 'min'])
early_1_all = pd.DataFrame(early_1_all[['TMA_Acct', 'egfr']].groupby(['TMA_Acct']).agg({'egfr': np.mean})).reset_index()
early_1_all['stage'] = early_1_all['egfr'].apply(lambda x: mapping(x))
part2 = pd.merge(early_1, early_1_all, how = 'inner', left_on = 'TMA_Acct', right_on = 'TMA_Acct')
num(part2)

745
745

In [36]:
part2_acct = list(part2['TMA_Acct'])

In [37]:
all_egfr_enter_before_2010 = all_egfr_enter_before_2010[~all_egfr_enter_before_2010['TMA_Acct'].isin(part2_acct)]
num(all_egfr_enter_before_2010)

20229
1039

In [41]:
part2

     TMA_Acct         min       egfr stage
0          37  2010-01-13  20.085950     4
1          97  2010-02-15  54.680604    3a
2         104  2010-02-17  74.032583     2
3         156  2010-02-15  29.937537     4
4         161  2010-03-05  43.505918    3b
..        ...         ...        ...   ...
740     33873  2010-02-12  56.768584    3a
741     35021  2010-02-01  39.817665    3b
742     35255  2010-03-16  37.442731    3b
743     35284  2010-01-14  39.538942    3b
744     36575  2010-03-01  90.240275     1

[745 rows x 4 columns]

### Part3

In [38]:
egfr_2 = all_egfr_enter_before_2010[(all_egfr_enter_before_2010['date'] > '2009-09-30') & (all_egfr_enter_before_2010['date'] < '2010-01-01')]
early_2 = pd.DataFrame(egfr_2.groupby(['TMA_Acct']).agg({'date': [np.min]})).reset_index()
early_2.columns=['TMA_Acct', 'min']
early_2_all = pd.merge(all_egfr_enter_before_2010, early_2, how = 'inner', left_on = ['TMA_Acct', 'date'], right_on = ['TMA_Acct', 'min'])
early_2_all = pd.DataFrame(early_2_all[['TMA_Acct', 'egfr']].groupby(['TMA_Acct']).agg({'egfr': np.mean})).reset_index()
early_2_all['stage'] = early_2_all['egfr'].apply(lambda x: mapping(x))
part3 = pd.merge(early_2, early_2_all, how = 'inner', left_on = 'TMA_Acct', right_on = 'TMA_Acct')
part3_acct = list(part3['TMA_Acct'])
num(part3)

408
408

In [40]:
part3

     TMA_Acct         min        egfr stage
0          90  2009-10-01   29.471587     4
1         136  2009-11-18   43.087447    3b
2         438  2009-11-09   66.711459     2
3         506  2009-11-02   36.279396    3b
4         618  2009-10-21   62.987680     2
..        ...         ...         ...   ...
403     36306  2009-10-06  124.917158     1
404     36458  2009-10-19   97.779646     1
405     36546  2009-10-07   81.442898     2
406     36572  2009-12-02   59.629796    3a
407     36625  2009-10-03   67.983983     2

[408 rows x 4 columns]

In [42]:
all_egfr_enter_before_2010 = all_egfr_enter_before_2010[~all_egfr_enter_before_2010['TMA_Acct'].isin(part3_acct)]
num(all_egfr_enter_before_2010)

10841
631

### Part4

In [43]:
egfr_3 = all_egfr_enter_before_2010[(all_egfr_enter_before_2010['date'] > '2010-03-31') & (all_egfr_enter_before_2010['date'] < '2010-07-01')]
early_3 = pd.DataFrame(egfr_3.groupby(['TMA_Acct']).agg({'date': [np.min]})).reset_index()
early_3.columns=['TMA_Acct', 'min']
early_3_all = pd.merge(all_egfr_enter_before_2010, early_3, how = 'inner', left_on = ['TMA_Acct', 'date'], right_on = ['TMA_Acct', 'min'])
early_3_all = pd.DataFrame(early_3_all[['TMA_Acct', 'egfr']].groupby(['TMA_Acct']).agg({'egfr': np.mean})).reset_index()
early_3_all['stage'] = early_3_all['egfr'].apply(lambda x: mapping(x))
part4 = pd.merge(early_3, early_3_all, how = 'inner', left_on = 'TMA_Acct', right_on = 'TMA_Acct')
part4_acct = list(part4['TMA_Acct'])
num(part4)

175
175

In [44]:
all_egfr_enter_before_2010 = all_egfr_enter_before_2010[~all_egfr_enter_before_2010['TMA_Acct'].isin(part4_acct)]
num(all_egfr_enter_before_2010)

7470
456

In [45]:
part4

     TMA_Acct         min       egfr stage
0         125  2010-05-06  31.961666    3b
1         214  2010-05-26  43.042065    3b
2         544  2010-04-03  84.354251     2
3         955  2010-04-06  35.154703    3b
4        1399  2010-04-23  62.928639     2
..        ...         ...        ...   ...
170     32642  2010-06-23  65.239312     2
171     33899  2010-04-27  39.969890    3b
172     34870  2010-06-18  35.761583    3b
173     35482  2010-06-12  66.244479     2
174     35798  2010-05-11  80.948675     2

[175 rows x 4 columns]

### Part5

In [46]:
egfr_4 = all_egfr_enter_before_2010[(all_egfr_enter_before_2010['date'] > '2009-06-30') & (all_egfr_enter_before_2010['date'] < '2009-10-01')]
early_4 = pd.DataFrame(egfr_4.groupby(['TMA_Acct']).agg({'date': [np.min]})).reset_index()
early_4.columns=['TMA_Acct', 'min']
early_4_all = pd.merge(all_egfr_enter_before_2010, early_4, how = 'inner', left_on = ['TMA_Acct', 'date'], right_on = ['TMA_Acct', 'min'])
early_4_all = pd.DataFrame(early_4_all[['TMA_Acct', 'egfr']].groupby(['TMA_Acct']).agg({'egfr': np.mean})).reset_index()
early_4_all['stage'] = early_4_all['egfr'].apply(lambda x: mapping(x))
part5 = pd.merge(early_4, early_4_all, how = 'inner', left_on = 'TMA_Acct', right_on = 'TMA_Acct')
part5_acct = list(part5['TMA_Acct'])
num(part5)

140
140

In [47]:
all_egfr_enter_before_2010 = all_egfr_enter_before_2010[~all_egfr_enter_before_2010['TMA_Acct'].isin(part5_acct)]
num(all_egfr_enter_before_2010)

4910
316

### Part6

In [48]:
part6 = all_egfr_enter_before_2010[all_egfr_enter_before_2010['date'] > '2010-01-01']
num(part6)

3063
316

In [49]:
egfr_4 = all_egfr_enter_before_2010[(all_egfr_enter_before_2010['date'] > '2009-06-30') & (all_egfr_enter_before_2010['date'] < '2009-10-01')]
early_4 = pd.DataFrame(egfr_4.groupby(['TMA_Acct']).agg({'date': [np.min]})).reset_index()
early_4.columns=['TMA_Acct', 'min']
early_4_all = pd.merge(all_egfr_enter_before_2010, early_4, how = 'inner', left_on = ['TMA_Acct', 'date'], right_on = ['TMA_Acct', 'min'])
early_4_all = pd.DataFrame(early_4_all[['TMA_Acct', 'egfr']].groupby(['TMA_Acct']).agg({'egfr': np.mean})).reset_index()
early_4_all['stage'] = early_4_all['egfr'].apply(lambda x: mapping(x))
part5 = pd.merge(early_4, early_4_all, how = 'inner', left_on = 'TMA_Acct', right_on = 'TMA_Acct')
part5_acct = list(part5['TMA_Acct'])
num(part5)

0
0

In [50]:
early_6 = pd.DataFrame(part6.groupby(['TMA_Acct']).agg({'date': [np.min]})).reset_index()
early_6.columns=['TMA_Acct', 'min']
num(early_6)
early_6.head(2)

316
316

   TMA_Acct         min
0       116  2011-05-19
1       403  2015-07-23

In [51]:
part6 = pd.merge(part6, early_6, how = 'inner', left_on = ['TMA_Acct', 'date'], right_on = ['TMA_Acct', 'min'])
early_6_all = pd.DataFrame(part6[['TMA_Acct', 'egfr']].groupby(['TMA_Acct']).agg({'egfr': np.mean})).reset_index()
early_6_all['stage'] = early_6_all['egfr'].apply(lambda x: mapping(x))
part6 = pd.merge(early_6, early_6_all, how = 'inner', left_on = 'TMA_Acct', right_on = 'TMA_Acct')
num(part6)

316
316

In [52]:
part6

     TMA_Acct         min        egfr stage
0         116  2011-05-19   19.151370     4
1         403  2015-07-23   28.655265     4
2         468  2013-01-31   56.000000    3a
3         532  2013-04-01   16.078698     4
4         756  2011-05-16   38.320260    3b
..        ...         ...         ...   ...
311     35505  2010-08-24  101.261456     1
312     36281  2012-12-07   56.635282    3a
313     36690  2013-03-13  128.964363     1
314     36822  2012-05-24   26.647857     4
315     37004  2016-10-10   86.758089     2

[316 rows x 4 columns]

In [53]:
egfr_earliest = pd.concat([part1, part2, part3, part4, part5, part6], axis = 0)

In [139]:
egfr_earliest.to_csv('egfr_earliest.csv')

In [140]:
egfr_earliest = pd.read_csv('egfr_earliest.csv')
num(egfr_earliest)

6859
6859

In [93]:
egfr_earliest_3a = egfr_earliest[egfr_earliest['stage'] == '3a']

In [94]:
egfr_earliest_3a_acct = list(set(list(egfr_earliest_3a['TMA_Acct'])))

### EGFR_Trajactory

baseline = pd.read_csv('baseline.csv')
stage_3a = list(baseline[baseline['stage'] == '3a']['TMA_Acct'])
egfr_3a = All_egfr[All_egfr['TMA_Acct'].isin(stage_3a)]
len(egfr_3a['TMA_Acct'].unique())

In [97]:
All_egfr = pd.read_csv('All_egfr.csv')
All_egfr_10 = All_egfr[(All_egfr['date'] > '2009-12-31') & (All_egfr['date'] < '2019-01-01')]
egfr_earliest_3a = egfr_earliest[egfr_earliest['stage'] == '3a']
egfr_earliest_3a_acct = list(set(list(egfr_earliest_3a['TMA_Acct'])))
print(len(egfr_earliest_3a))
egfr_earliest_3b = egfr_earliest[egfr_earliest['stage'] == '3b']
egfr_earliest_3b_acct = list(set(list(egfr_earliest_3b['TMA_Acct'])))
egfr_earliest_4 = egfr_earliest[egfr_earliest['stage'] == '4']
egfr_earliest_4_acct = list(set(list(egfr_earliest_4['TMA_Acct'])))
egfr_earliest_5 = egfr_earliest[egfr_earliest['stage'] == '5']
egfr_earliest_5_acct = list(set(list(egfr_earliest_5['TMA_Acct'])))
print(len(egfr_earliest_3b))
print(len(egfr_earliest_4))
print(len(egfr_earliest_5))

1623
1741
1000
577

In [98]:
def final_in_stage(stage_acct):
    All_egfr_3a = All_egfr_10[All_egfr_10['TMA_Acct'].isin(stage_acct)]
    All_egfr_3a = All_egfr_3a[['TMA_Acct', 'date', 'stage','egfr']]
    All_egfr_3a = All_egfr_3a.drop_duplicates()
    early = pd.DataFrame(All_egfr_3a.groupby(['TMA_Acct']).agg({'date': [np.min]})).reset_index()
    early.columns=['TMA_Acct', 'min']
    print()
    All_egfr_3a = pd.merge(All_egfr_3a, early, how = 'left', left_on = ['TMA_Acct'], right_on = ['TMA_Acct'])
    All_egfr_3a['date'] = pd.to_datetime(All_egfr_3a['date'])
    All_egfr_3a['min'] = pd.to_datetime(All_egfr_3a['min'])
    All_egfr_3a['period'] = ((All_egfr_3a['date'] - All_egfr_3a['min']).dt.days / 90).astype('int')
    egfr_traj = All_egfr_3a[['TMA_Acct', 'egfr', 'period']]
    egfr_traj = pd.DataFrame(egfr_traj.groupby(['TMA_Acct', 'period']).agg({'egfr': np.mean})).reset_index()
    egfr_traj = egfr_traj.pivot(index='TMA_Acct', columns='period', values='egfr')
    print(len(egfr_traj))
    final = egfr_traj.dropna(thresh=3)
    print(len(final))
    for i in range(37):
        final['t' + str(i)] = i
        final.rename(columns={i: "v" + str(i)}, inplace = 'True')
    return final

In [99]:
final_3a = final_in_stage(egfr_earliest_3a_acct)
final_3b = final_in_stage(egfr_earliest_3b_acct)
final_4 = final_in_stage(egfr_earliest_4_acct)
final_5 = final_in_stage(egfr_earliest_5_acct)

1623
999

C:\Users\DELL\anaconda3\lib\site-packages\ipykernel_launcher.py:19: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
C:\Users\DELL\AppData\Roaming\Python\Python37\site-packages\pandas\core\frame.py:4133: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

1741
1146

1000
634

577
334

In [100]:
final_3a.to_csv('final_3a.csv')
final_3b.to_csv('final_3b.csv')
final_4.to_csv('final_4.csv')
final_5.to_csv('final_5.csv')

### Trajactory Analysis

In [54]:
baseline = pd.read_csv('baseline.csv')
baseline.head(2)

,Unnamed: 0,TMA_Acct,DOB,Sex,Race,hyper_date,diabe_date,earliest_date_in_all_lab,Date_bmi,BMI,Age_in_2010,avg_egfr,earliest_egfr_date,stage,Patient_Status_Date,Patient_Status
0,0,9,1921,Male,White,2001-05-29,NaN,2000-09-22,NaN,NaN,89,NaN,NaN,NaN,6-30-2010,Deceased
1,1,10,1926,Female,NaN,NaN,NaN,NaN,NaN,NaN,84,NaN,NaN,NaN,NaN,Active

In [55]:
set(list(baseline['Race']))

{'American Indian/Alaska Native',
 'Asian',
 'Black / African American, Black',
 'Black/African American',
 'Black/African American, Other',
 'Declined to Specify/Unknown',
 'Other',
 'White',
 'White, Black/African American',
 'White, Other',
 nan}

In [56]:
baseline_acct = list(baseline['TMA_Acct'])

In [57]:
final3a = pd.read_csv('final_3a.csv')
final3b = pd.read_csv('final_3b.csv')
final4 = pd.read_csv('final_4.csv')

In [58]:
final3a_acct = list(final3a['TMA_Acct'])

In [59]:
len([i for i in final3a_acct if i not in baseline_acct])

98

In [60]:
def final_base(final, base):
    base = base.fillna('n')
    base = base[['TMA_Acct', 'Sex', 'Race', 'hyper_date', 'diabe_date', 'Age_in_2010']]
    final_base = pd.merge(final, base, how = 'inner', left_on = 'TMA_Acct', right_on = 'TMA_Acct')
    final_base['sex_v'] = final_base['Sex'].apply(lambda x: 1 if x == 'Female' else 0)
    final_base['race_v'] = final_base['Race'].apply(lambda x: 1 if x == 'Black / African American, Black' or x == 'Black/African American' or x == 'Black/African American, Other' else 0)
    final_base['hyper_v'] = final_base['hyper_date'].apply(lambda x: 0 if x == 'n' else 1)
    final_base['diabe_v'] = final_base['diabe_date'].apply(lambda x: 0 if x == 'n' else 1)
    return final_base

In [61]:
final_3a_base = final_base(final3a, baseline)
final_3a_base.to_csv('final_3a_base_2.csv')

In [143]:
final_3b_base = final_base(final3b, baseline)
final_3b_base.to_csv('final_3b_base.csv')
final_4_base = final_base(final4, baseline)
final_4_base.to_csv('final_4_base.csv')

In [144]:
len(final_3b_base)

997

In [145]:
len(final_4_base)

572

In [110]:
final_3a_base.head(2)

,TMA_Acct,v0,v1,v2,v3,v4,v5,v6,v7,v8,...,t36,Sex,Race,hyper_date,diabe_date,Age_in_2010,sex_v,race_v,hyper_v,diabe_v
0,97,54.680604,NaN,NaN,NaN,39.538942,33.257395,NaN,NaN,30.545747,...,36,Female,White,2006-03-15,2006-03-15,76,1,0,1,1
1,499,54.809306,NaN,NaN,NaN,NaN,40.110099,45.415715,40.735367,44.084108,...,36,Male,White,2012-09-11,n,82,0,0,1,0

In [111]:
len(final_4_base)

572

In [112]:
egfr_3a_pro = pd.read_csv("egfr_3a_pro.csv")

In [113]:
data = ["_traj_Group"]
string = "_traj_Group_T"
for i in range(1, 37):
    data.append(string + str(i))
print(data)
group = egfr_3a_pro[data]

['_traj_Group', '_traj_Group_T1', '_traj_Group_T2', '_traj_Group_T3', '_traj_Group_T4', '_traj_Group_T5', '_traj_Group_T6', '_traj_Group_T7', '_traj_Group_T8', '_traj_Group_T9', '_traj_Group_T10', '_traj_Group_T11', '_traj_Group_T12', '_traj_Group_T13', '_traj_Group_T14', '_traj_Group_T15', '_traj_Group_T16', '_traj_Group_T17', '_traj_Group_T18', '_traj_Group_T19', '_traj_Group_T20', '_traj_Group_T21', '_traj_Group_T22', '_traj_Group_T23', '_traj_Group_T24', '_traj_Group_T25', '_traj_Group_T26', '_traj_Group_T27', '_traj_Group_T28', '_traj_Group_T29', '_traj_Group_T30', '_traj_Group_T31', '_traj_Group_T32', '_traj_Group_T33', '_traj_Group_T34', '_traj_Group_T35', '_traj_Group_T36']

In [114]:

for i in data:
    print(group[i].value_counts().sort_index())

1    146
2    323
3    358
4    103
Name: _traj_Group, dtype: int64
1     26
2    363
3    501
4     40
Name: _traj_Group_T1, dtype: int64
1     74
2    358
3    447
4     51
Name: _traj_Group_T2, dtype: int64
1    102
2    336
3    422
4     70
Name: _traj_Group_T3, dtype: int64
1    117
2    331
3    400
4     82
Name: _traj_Group_T4, dtype: int64
1    121
2    328
3    397
4     84
Name: _traj_Group_T5, dtype: int64
1    126
2    317
3    402
4     85
Name: _traj_Group_T6, dtype: int64
1    128
2    319
3    395
4     88
Name: _traj_Group_T7, dtype: int64
1    130
2    319
3    393
4     88
Name: _traj_Group_T8, dtype: int64
1    129
2    321
3    388
4     92
Name: _traj_Group_T9, dtype: int64
1    121
2    331
3    384
4     94
Name: _traj_Group_T10, dtype: int64
1    125
2    336
3    373
4     96
Name: _traj_Group_T11, dtype: int64
1    126
2    331
3    379
4     94
Name: _traj_Group_T12, dtype: int64
1    126
2    335
3    374
4     95
Name: _traj_Group_T13, dtype: int64
1    128
2    331
3    375
4     96
Name: _traj_Group_T14, dtype: int64
1    129
2    332
3    370
4     99
Name: _traj_Group_T15, dtype: int64
1    131
2    329
3    372
4     98
Name: _traj_Group_T16, dtype: int64
1    131
2    327
3    372
4    100
Name: _traj_Group_T17, dtype: int64
1    133
2    330
3    369
4     98
Name: _traj_Group_T18, dtype: int64
1    133
2    327
3    371
4     99
Name: _traj_Group_T19, dtype: int64
1    137
2    323
3    370
4    100
Name: _traj_Group_T20, dtype: int64
1    139
2    325
3    369
4     97
Name: _traj_Group_T21, dtype: int64
1    140
2    325
3    366
4     99
Name: _traj_Group_T22, dtype: int64
1    141
2    329
3    362
4     98
Name: _traj_Group_T23, dtype: int64
1    142
2    331
3    359
4     98
Name: _traj_Group_T24, dtype: int64
1    141
2    331
3    359
4     99
Name: _traj_Group_T25, dtype: int64
1    143
2    330
3    357
4    100
Name: _traj_Group_T26, dtype: int64
1    147
2    328
3    355
4    100
Name: _traj_Group_T27, dtype: int64
1    147
2    326
3    358
4     99
Name: _traj_Group_T28, dtype: int64
1    148
2    325
3    356
4    101
Name: _traj_Group_T29, dtype: int64
1    148
2    324
3    357
4    101
Name: _traj_Group_T30, dtype: int64
1    147
2    324
3    356
4    103
Name: _traj_Group_T31, dtype: int64
1    146
2    324
3    356
4    104
Name: _traj_Group_T32, dtype: int64
1    145
2    326
3    354
4    105
Name: _traj_Group_T33, dtype: int64
1    145
2    324
3    358
4    103
Name: _traj_Group_T34, dtype: int64
1    146
2    323
3    358
4    103
Name: _traj_Group_T35, dtype: int64
1    146
2    323
3    358
4    103
Name: _traj_Group_T36, dtype: int64

In [115]:
clean_data = {}
for i in data:
    num = group[i].value_counts().sort_index()
    clean_data[i] = num.values
    print(group[i].value_counts().sort_index())

1    146
2    323
3    358
4    103
Name: _traj_Group, dtype: int64
1     26
2    363
3    501
4     40
Name: _traj_Group_T1, dtype: int64
1     74
2    358
3    447
4     51
Name: _traj_Group_T2, dtype: int64
1    102
2    336
3    422
4     70
Name: _traj_Group_T3, dtype: int64
1    117
2    331
3    400
4     82
Name: _traj_Group_T4, dtype: int64
1    121
2    328
3    397
4     84
Name: _traj_Group_T5, dtype: int64
1    126
2    317
3    402
4     85
Name: _traj_Group_T6, dtype: int64
1    128
2    319
3    395
4     88
Name: _traj_Group_T7, dtype: int64
1    130
2    319
3    393
4     88
Name: _traj_Group_T8, dtype: int64
1    129
2    321
3    388
4     92
Name: _traj_Group_T9, dtype: int64
1    121
2    331
3    384
4     94
Name: _traj_Group_T10, dtype: int64
1    125
2    336
3    373
4     96
Name: _traj_Group_T11, dtype: int64
1    126
2    331
3    379
4     94
Name: _traj_Group_T12, dtype: int64
1    126
2    335
3    374
4     95
Name: _traj_Group_T13, dtype: int64
1    128
2    331
3    375
4     96
Name: _traj_Group_T14, dtype: int64
1    129
2    332
3    370
4     99
Name: _traj_Group_T15, dtype: int64
1    131
2    329
3    372
4     98
Name: _traj_Group_T16, dtype: int64
1    131
2    327
3    372
4    100
Name: _traj_Group_T17, dtype: int64
1    133
2    330
3    369
4     98
Name: _traj_Group_T18, dtype: int64
1    133
2    327
3    371
4     99
Name: _traj_Group_T19, dtype: int64
1    137
2    323
3    370
4    100
Name: _traj_Group_T20, dtype: int64
1    139
2    325
3    369
4     97
Name: _traj_Group_T21, dtype: int64
1    140
2    325
3    366
4     99
Name: _traj_Group_T22, dtype: int64
1    141
2    329
3    362
4     98
Name: _traj_Group_T23, dtype: int64
1    142
2    331
3    359
4     98
Name: _traj_Group_T24, dtype: int64
1    141
2    331
3    359
4     99
Name: _traj_Group_T25, dtype: int64
1    143
2    330
3    357
4    100
Name: _traj_Group_T26, dtype: int64
1    147
2    328
3    355
4    100
Name: _traj_Group_T27, dtype: int64
1    147
2    326
3    358
4     99
Name: _traj_Group_T28, dtype: int64
1    148
2    325
3    356
4    101
Name: _traj_Group_T29, dtype: int64
1    148
2    324
3    357
4    101
Name: _traj_Group_T30, dtype: int64
1    147
2    324
3    356
4    103
Name: _traj_Group_T31, dtype: int64
1    146
2    324
3    356
4    104
Name: _traj_Group_T32, dtype: int64
1    145
2    326
3    354
4    105
Name: _traj_Group_T33, dtype: int64
1    145
2    324
3    358
4    103
Name: _traj_Group_T34, dtype: int64
1    146
2    323
3    358
4    103
Name: _traj_Group_T35, dtype: int64
1    146
2    323
3    358
4    103
Name: _traj_Group_T36, dtype: int64

In [116]:
clean_data

{'_traj_Group': array([146, 323, 358, 103], dtype=int64),
 '_traj_Group_T1': array([ 26, 363, 501,  40], dtype=int64),
 '_traj_Group_T2': array([ 74, 358, 447,  51], dtype=int64),
 '_traj_Group_T3': array([102, 336, 422,  70], dtype=int64),
 '_traj_Group_T4': array([117, 331, 400,  82], dtype=int64),
 '_traj_Group_T5': array([121, 328, 397,  84], dtype=int64),
 '_traj_Group_T6': array([126, 317, 402,  85], dtype=int64),
 '_traj_Group_T7': array([128, 319, 395,  88], dtype=int64),
 '_traj_Group_T8': array([130, 319, 393,  88], dtype=int64),
 '_traj_Group_T9': array([129, 321, 388,  92], dtype=int64),
 '_traj_Group_T10': array([121, 331, 384,  94], dtype=int64),
 '_traj_Group_T11': array([125, 336, 373,  96], dtype=int64),
 '_traj_Group_T12': array([126, 331, 379,  94], dtype=int64),
 '_traj_Group_T13': array([126, 335, 374,  95], dtype=int64),
 '_traj_Group_T14': array([128, 331, 375,  96], dtype=int64),
 '_traj_Group_T15': array([129, 332, 370,  99], dtype=int64),
 '_traj_Group_T16': array([131, 329, 372,  98], dtype=int64),
 '_traj_Group_T17': array([131, 327, 372, 100], dtype=int64),
 '_traj_Group_T18': array([133, 330, 369,  98], dtype=int64),
 '_traj_Group_T19': array([133, 327, 371,  99], dtype=int64),
 '_traj_Group_T20': array([137, 323, 370, 100], dtype=int64),
 '_traj_Group_T21': array([139, 325, 369,  97], dtype=int64),
 '_traj_Group_T22': array([140, 325, 366,  99], dtype=int64),
 '_traj_Group_T23': array([141, 329, 362,  98], dtype=int64),
 '_traj_Group_T24': array([142, 331, 359,  98], dtype=int64),
 '_traj_Group_T25': array([141, 331, 359,  99], dtype=int64),
 '_traj_Group_T26': array([143, 330, 357, 100], dtype=int64),
 '_traj_Group_T27': array([147, 328, 355, 100], dtype=int64),
 '_traj_Group_T28': array([147, 326, 358,  99], dtype=int64),
 '_traj_Group_T29': array([148, 325, 356, 101], dtype=int64),
 '_traj_Group_T30': array([148, 324, 357, 101], dtype=int64),
 '_traj_Group_T31': array([147, 324, 356, 103], dtype=int64),
 '_traj_Group_T32': array([146, 324, 356, 104], dtype=int64),
 '_traj_Group_T33': array([145, 326, 354, 105], dtype=int64),
 '_traj_Group_T34': array([145, 324, 358, 103], dtype=int64),
 '_traj_Group_T35': array([146, 323, 358, 103], dtype=int64),
 '_traj_Group_T36': array([146, 323, 358, 103], dtype=int64)}

In [117]:
egfr_3a_num = pd.DataFrame(clean_data)

In [118]:
import matplotlib.pyplot as plt

In [25]:
egfr_3a_num

,_traj_Group,_traj_Group_T1,_traj_Group_T2,_traj_Group_T3,_traj_Group_T4,_traj_Group_T5,_traj_Group_T6,_traj_Group_T7,_traj_Group_T8,_traj_Group_T9,...,_traj_Group_T27,_traj_Group_T28,_traj_Group_T29,_traj_Group_T30,_traj_Group_T31,_traj_Group_T32,_traj_Group_T33,_traj_Group_T34,_traj_Group_T35,_traj_Group_T36
0,146,26,74,102,117,121,126,128,130,129,...,147,147,148,148,147,146,145,145,146,146
1,323,363,358,336,331,328,317,319,319,321,...,328,326,325,324,324,324,326,324,323,323
2,358,501,447,422,400,397,402,395,393,388,...,355,358,356,357,356,356,354,358,358,358
3,103,40,51,70,82,84,85,88,88,92,...,100,99,101,101,103,104,105,103,103,103

In [63]:
final_3a_base2 = pd.read_csv('final_3a_base_2.csv')

In [64]:
final_3a_base = pd.read_csv('final_3a_base.csv')

In [66]:
[i for i in list(final_3a_base['TMA_Acct']) if i not in list(final_3a_base2['TMA_Acct'])]

[1935,
 2955,
 3274,
 3524,
 4898,
 5413,
 7530,
 7935,
 8752,
 9408,
 11386,
 12534,
 13148,
 18646,
 18900,
 19345,
 19362,
 20818,
 20880,
 27153,
 27460,
 27467,
 30380,
 30654,
 32996,
 33048,
 33283,
 34226,
 34347]

In [67]:
final_3a_base[final_3a_base['TMA_Acct'] == 1935]

,Unnamed: 0,TMA_Acct,v0,v1,v2,v3,v4,v5,v6,v7,...,t36,Sex,Race,hyper_date,diabe_date,Age_in_2010,sex_v,race_v,hyper_v,diabe_v
15,15,1935,50.471162,NaN,61.0,NaN,50.837145,NaN,NaN,55.845163,...,36,Female,White,2009-09-04,2007-05-12,71,1,0,1,1

In [56]:
data = pd.read_csv('egfr_earliest.csv')

In [58]:
data.head(2)

   Unnamed: 0  TMA_Acct       egfr stage                 date  min
0           0        64  10.000000     5  2018-05-15 00:00:00  NaN
1           1        86  20.121101     4           2010-10-09  NaN

In [59]:
data1 = data[['TMA_Acct', 'egfr', 'stage', 'date']]
data2 = data[['TMA_Acct', 'egfr', 'stage', 'min']]

In [60]:
data1.rename(columns={"date": "min"}, inplace = 'True')

C:\Users\DELL\AppData\Roaming\Python\Python37\site-packages\pandas\core\frame.py:4133: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [62]:
data = pd.concat([data1, data2], axis = 0)

In [63]:
data.to_csv('egfr_eariest.csv')